# Create a Python connection with SQL database

#### Connect Python to SQL

In [1]:
import pandas as pd
import numpy as np
import pymysql
from sqlalchemy import create_engine
import getpass

In [2]:
password = getpass.getpass()

········

In [4]:
connection_string = 'mysql+pymysql://root:'+password+'@localhost/sakila'
engine = create_engine(connection_string)

#### 1. How many distinct actors' last name are there?

In [5]:
query_1 = '''SELECT COUNT(DISTINCT last_name) 
FROM sakila.actor;'''
data1 = pd.read_sql_query(query_1, engine)
data1.head()

   COUNT(DISTINCT last_name)
0                        121

#### 2.  Add an additional column day_type with values 'weekend' and 'workday' depending on the rental day of the week.

In [6]:
query_2 = '''SELECT rental_id, rental_date,  WEEKDAY(rental_date) AS 'weekday',
CASE
WHEN WEEKDAY(rental_date) IN (5,6) THEN 'Weekend'
ELSE 'Workday'
END AS 'Weekday' 
FROM sakila.rental;'''

data2 = pd.read_sql_query(query_2, engine)
data2

       rental_id         rental_date  weekday  Weekday
0              1 2005-05-24 22:53:30        1  Workday
1              2 2005-05-24 22:54:33        1  Workday
2              3 2005-05-24 23:03:39        1  Workday
3              4 2005-05-24 23:04:41        1  Workday
4              5 2005-05-24 23:05:21        1  Workday
...          ...                 ...      ...      ...
16040      15966 2006-02-14 15:16:03        1  Workday
16041      11676 2006-02-14 15:16:03        1  Workday
16042      14616 2006-02-14 15:16:03        1  Workday
16043      11739 2006-02-14 15:16:03        1  Workday
16044      16050 2022-09-19 17:00:46        0  Workday

[16045 rows x 4 columns]

#### 3. Get all films with ARMAGEDDON in the title.

In [7]:
data3 = pd.read_sql_query('SELECT title FROM sakila.film', engine)
data3[data3['title'].str.contains("ARMAGEDDON")]

                     title
38         ARMAGEDDON LOST
506    LADYBUGS ARMAGEDDON
570       METAL ARMAGEDDON
597    MOSQUITO ARMAGEDDON
837  STAGECOACH ARMAGEDDON
843      STEERS ARMAGEDDON

#### 4. Get the 10 longest films.

In [8]:
query_4 = '''SELECT title, length FROM sakila.film
ORDER BY length DESC
LIMIT 10;'''

data4 = pd.read_sql_query(query_4, engine)
data4

                title  length
0      DARN FORRESTER     185
1        POND SEATTLE     185
2       CHICAGO NORTH     185
3       MUSCLE BRIGHT     185
4        WORST BANGER     185
5         GANGS PRIDE     185
6  SOLDIERS EVOLUTION     185
7           HOME PITY     185
8   SWEET BROTHERHOOD     185
9      CONTROL ANTHEM     185

#### 5. How many films include Behind the Scenes content?

In [16]:
data5 = pd.read_sql_query('SELECT title, special_features  FROM sakila.film', engine)
data5[data5['special_features'].str.contains("Behind the Scenes")]

                title                           special_features
0    ACADEMY DINOSAUR           Deleted Scenes,Behind the Scenes
3    AFFAIR PREJUDICE             Commentaries,Behind the Scenes
10    ALAMO VIDEOTAPE             Commentaries,Behind the Scenes
12        ALI FOREVER           Deleted Scenes,Behind the Scenes
13     ALICE FANTASIA  Trailers,Deleted Scenes,Behind the Scenes
..                ...                                        ...
990      WORST BANGER           Deleted Scenes,Behind the Scenes
992    WRONG BEHAVIOR                 Trailers,Behind the Scenes
995    YOUNG LANGUAGE                 Trailers,Behind the Scenes
996        YOUTH KICK                 Trailers,Behind the Scenes
999         ZORRO ARK    Trailers,Commentaries,Behind the Scenes

[538 rows x 2 columns]

#### 6. Which kind of movies (rating) have a mean duration of more than two hours?

In [17]:
query_6 = '''SELECT rating, COUNT(title), ROUND(AVG(length),2) AS avg_length FROM sakila.film
GROUP BY rating
HAVING avg_length >120;'''

data6 = pd.read_sql_query(query_6, engine)
data6.head()

  rating  COUNT(title)  avg_length
0  PG-13           223      120.44

#### 7. Rank films by length (filter out the rows that have nulls or 0s in length column). In your output, only select the columns title, length, and the rank.

In [18]:
query_7 = "SELECT DENSE_RANK() OVER(ORDER BY length DESC) as 'Rank', title, length FROM film WHERE length != 0 and length IS NOT NULL;"
data7 = pd.read_sql_query(query_7, engine)
data7.head()

   Rank           title  length
0     1   CHICAGO NORTH     185
1     1  CONTROL ANTHEM     185
2     1  DARN FORRESTER     185
3     1     GANGS PRIDE     185
4     1       HOME PITY     185